import React, { useState } from 'react';
import ProductCard from './component/ProductCard';

const ProductReview = () => {
    const products = [
        {
            name: "Prowild ",
            description: "Prowild เป็นอาหารสุนัขเกรดพรีเมียมที่เหมาะสำหรับสุนัขที่มีอาการแพ้หรือไวต่อส่วนผสมบางชนิด โดยใช้เนื้อแกะและปลาทูน่าจากออสเตรเลียเป็นแหล่งโปรตีนหลัก และไม่มีส่วนผสมของไก่ ข้าวโพด ข้าวสาลี หรือถั่วเหลือง อาหารชนิดนี้ปราศจากสารเติมแต่ง เช่น กลิ่น สี หรือสารกันบูด มีกรดไขมันโอเมก้า 6 และ 3 ช่วยบำรุงผิวหนังและเส้นขนให้สวยเงางาม ทำให้เหมาะสำหรับสุนัขที่ต้องการอาหารที่ย่อยง่ายและดีต่อสุขภาพ ",
            shopeeUrl: "https://s.shopee.co.th/8UwACfe7Es",
            imageUrl: "/images/prowild.png"
        },
        {
            name: "Hill’s Science Diet",
            description: "Hill’s Science Diet คืออาหารเม็ดที่พัฒนาโดยสัตวแพทย์ โดยมีการวิจัยเพื่อช่วยเสริมสร้างสุขภาพที่ดีในทุกด้านของสุนัข อาหารชนิดนี้เหมาะสำหรับสุนัขที่ต้องการควบคุมน้ำหนักหรือมีปัญหาผิวหนังแห้งและแพ้ง่าย สูตรนี้ใช้วัตถุดิบที่มีคุณภาพสูง เช่น โปรตีนจากเนื้อสัตว์แท้ และไฟเบอร์ที่ช่วยในการย่อยอาหาร พร้อมทั้งมีส่วนผสมของวิตามินและแร่ธาตุที่จำเป็นสำหรับการบำรุงกระดูก ฟัน และผิวหนัง ทำให้สุนัขของคุณมีสุขภาพดีและแข็งแรง.",
            shopeeUrl: "https://s.shopee.co.th/3qAKeE6KXL",
            imageUrl: "/images/hillScience.png"
        },
        {
            name: "Orijen",
            description: "Orijen เป็นอาหารเม็ดที่ดีที่สุดสำหรับสุนัขที่มีความต้องการพลังงานสูง และต้องการโปรตีนคุณภาพสูงจากเนื้อสัตว์แท้กว่า 85% โดยไม่ใส่ธัญพืช ซึ่งทำให้ Orijen เป็นอาหารที่อุดมไปด้วยสารอาหารจากธรรมชาติเต็มรูปแบบ รวมถึงการใช้เนื้อสัตว์สดแท้จากแหล่งที่เชื่อถือได้ เช่น ปลาแซลมอน ไก่ และเนื้อแกะ เพื่อเสริมสร้างความแข็งแรงของกล้ามเนื้อและระบบย่อยอาหาร Orijen ยังมีสารอาหารที่ช่วยเสริมภูมิคุ้มกันและบำรุงขนและผิวหนังให้มีสุขภาพดี.",
            shopeeUrl: "https://s.shopee.co.th/3Audr6Sa4L",
            imageUrl: "/images/Orijen.png"
        },
        {
            name: "Taste of the Wild",
            description: "Taste of the Wild เป็นอาหารเม็ดสำหรับสุนัขที่มีคุณภาพสูงและปราศจากธัญพืช สูตรนี้ใช้โปรตีนจากเนื้อสัตว์หลากหลายชนิด เช่น เนื้อกวาง ปลาแซลมอน และเนื้อควาย ซึ่งช่วยเสริมสร้างกล้ามเนื้อและกระดูกให้แข็งแรง รวมถึงการเสริมโพรไบโอติกส์ที่ช่วยดูแลระบบย่อยอาหาร นอกจากนี้ยังมีสารต้านอนุมูลอิสระจากผลไม้และผักต่างๆ ที่ช่วยเสริมสร้างระบบภูมิคุ้มกันและบำรุงผิวหนังให้มีสุขภาพดี.",
            shopeeUrl: "https://s.shopee.co.th/8Kck0iriyt",
            imageUrl: "/images/tasteOfTheWild.png"
        },
        {
            name: "Pedigree",
            description: "Pedigree คืออาหารเม็ดที่เหมาะสำหรับเจ้าของสุนัขที่ต้องการอาหารที่คุ้มค่าและคุณภาพสูงในราคาที่เหมาะสม สูตรนี้อุดมด้วยโปรตีนจากเนื้อสัตว์คุณภาพสูงและสารอาหารที่ช่วยในการบำรุงกระดูกและฟัน รวมถึงการบำรุงขนให้สุขภาพดีและนุ่มสลวย Pedigree ยังมีรสชาติที่ถูกปากสุนัขและได้รับความนิยมอย่างแพร่หลาย สูตรนี้ยังมีตัวเลือกสำหรับสุนัขพันธุ์เล็กและใหญ่ รวมทั้งสูตรสำหรับสุนัขในช่วงวัยต่างๆ เพื่อการดูแลที่เหมาะสม.",
            shopeeUrl: "https://s.shopee.co.th/9UohOvdpXV",
            imageUrl: "/images/Pedigree.png"
        },
        {
            name: "Purina Pro Plan",
            description: "Purina Pro Plan คืออาหารเม็ดที่พัฒนาขึ้นโดยสัตวแพทย์และผู้เชี่ยวชาญด้านโภชนาการสุนัข โดยเน้นไปที่การเสริมสร้างสุขภาพระยะยาวในทุกด้าน ไม่ว่าจะเป็นการเสริมภูมิคุ้มกัน การพัฒนากล้ามเนื้อ หรือการดูแลสุขภาพผิวและขน อาหารสูตรนี้มีการใช้โปรตีนจากเนื้อสัตว์คุณภาพสูง เช่น ไก่และปลา พร้อมทั้งมีส่วนผสมของวิตามินและแร่ธาตุต่างๆ ที่ช่วยเสริมสร้างกระดูกและฟันให้แข็งแรง และยังช่วยเสริมสุขภาพสมองให้คมชัดและกระฉับกระเฉง.",
            shopeeUrl: "https://s.shopee.co.th/707MQREl9c",
            imageUrl: "/images/PurinaProPlan.png"
        },
        {
            name: "Canagan",
            description: "Canagan เป็นอาหารเม็ดคุณภาพสูงจากอังกฤษที่ใช้เนื้อสัตว์สดและออร์แกนิกปราศจากธัญพืช เพื่อให้สุนัขได้รับอาหารที่ดีที่สุดจากธรรมชาติที่มีโปรตีนสูงและไขมันต่ำ สูตรนี้ช่วยให้ระบบย่อยอาหารทำงานได้อย่างดี และยังมีส่วนผสมของผักและผลไม้ที่อุดมไปด้วยวิตามินและแร่ธาตุต่างๆ ที่ช่วยเสริมระบบภูมิคุ้มกันและบำรุงผิวหนังให้มีสุขภาพดี อาหารนี้เหมาะสำหรับสุนัขที่มีอาการแพ้ง่ายหรือผิวบอบบาง.",
            shopeeUrl: "https://s.shopee.co.th/2qHnSsNnYQ",
            imageUrl: "/images/Canagan.png"
        },
        {
            name: "SmartHeart Gold",
            description: "SmartHeart Gold อาหารเม็ดที่มีคุณภาพสูงในราคาย่อมเยา โดยมีส่วนผสมของ Omega 3-6 ที่ช่วยบำรุงขนและผิวหนังให้นุ่มสลวยและเงางาม นอกจากนี้ยังมีวิตามินและแร่ธาตุที่ช่วยเสริมสร้างกระดูกและฟันให้แข็งแรง รวมถึงการช่วยเสริมระบบย่อยอาหารให้มีประสิทธิภาพ เหมาะสำหรับสุนัขทั่วไปที่ต้องการอาหารที่ดีและราคาไม่แพง.",
            shopeeUrl: "https://s.shopee.co.th/AA4OCSXKUq",
            imageUrl: "/images/SmartHeartGold.png"
        },
        {
            name: "Acana",
            description: "Acana คืออาหารเม็ดที่มาจากแคนาดา ใช้วัตถุดิบธรรมชาติ 100% โดยไม่มีธัญพืช เพื่อให้สุนัขได้รับโปรตีนจากแหล่งที่มีคุณภาพสูง เช่น เนื้อไก่สด, ปลาแซลมอน, และเนื้อแกะ ซึ่งช่วยเสริมสร้างกล้ามเนื้อและระบบย่อยอาหารให้มีประสิทธิภาพ Acana ยังมีส่วนผสมของผักและผลไม้ที่ช่วยเสริมสุขภาพสมบูรณ์ให้กับสุนัข และยังช่วยบำรุงขนให้เงางามและลดการแพ้ได้อีกด้วย.",
            shopeeUrl: "https://s.shopee.co.th/1LSzgJu9A2",
            imageUrl: "/images/Acana.png"
        },
        {
            name: "Royal Canin",
            description: "Royal Canin เป็นอาหารเม็ดเกรดพรีเมียมที่ออกแบบมาเฉพาะสำหรับสุนัขแต่ละสายพันธุ์ โดยมีสูตรพิเศษที่ตอบโจทย์คุณสมบัติทางพันธุกรรมของสุนัขแต่ละพันธุ์ เช่น การบำรุงขนให้เงางาม ลดปัญหากลิ่นตัว และเสริมสร้างระบบย่อยอาหารที่มีประสิทธิภาพ อาหารชนิดนี้อุดมไปด้วยโปรตีนจากเนื้อสัตว์แท้ เช่น ไก่ ปลา และเนื้อแกะ พร้อมกับสารอาหารที่สำคัญ เช่น วิตามินและแร่ธาตุต่างๆ ที่ช่วยเสริมสร้างภูมิคุ้มกันและบำรุงสุขภาพโดยรวม Royal Canin เหมาะสำหรับสุนัขพันธุ์แท้ทุกช่วงวัยที่ต้องการการดูแลเป็นพิเศษเพื่อสุขภาพที่ดีและยาวนาน.",
            shopeeUrl: "https://s.shopee.co.th/20igTdkmlC",
            imageUrl: "/images/royalcanin.png"
        }
    ];
      
      

  return (
    <div className="max-w-6xl mx-auto px-4 py-10 bg-gray-50">
      <h2 className="text-3xl font-semibold text-gray-800 mb-2 text-center">แนะนำ 10 อาหารสุนัข ยี่ห้อไหนดี 2025</h2>
      {products.map((product) => (
        <ProductCard
          key={product.name}
          product={product}
        />
      ))}
    </div>
  );
};

export default ProductReview;
